podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/RTC_STM32F030.svd.xml
            <register>
               <name>TSSSR</name>
               <description>time-stamp sub second register</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SS</name>
                     <description>Sub second value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALR</name>
               <description>calibration register</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>CALM</name>
                     <description>Calibration minus</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>CALW16</name>
                     <description>Reserved</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALW8</name>
                     <description>Use a 16-second calibration cycle
              period</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALP</name>
                     <description>Use an 8-second calibration cycle
              period</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAFCR</name>
               <description>tamper and alternate function configuration
          register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>TAMP1E</name>
                     <description>RTC_TAMP1 input detection
              enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMP1TRG</name>
                     <description>Active level for RTC_TAMP1
              input</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMPIE</name>
                     <description>Tamper interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMP2E</name>
                     <description>RTC_TAMP2 input detection
              enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMP2_TRG</name>
                     <description>Active level for RTC_TAMP2
              input</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMPTS</name>
                     <description>Activate timestamp on tamper detection
              event</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAMPFREQ</name>
                     <description>Tamper sampling frequency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TAMPFLT</name>
                     <description>RTC_TAMPx filter count</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TAMP_PRCH</name>
                     <description>RTC_TAMPx precharge
              duration</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TAMP_PUDIS</name>
                     <description>RTC_TAMPx pull-up disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PC13VALUE</name>
                     <description>RTC_ALARM output type/PC13
              value</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PC13MODE</name>
                     <description>PC13 mode</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PC14VALUE</name>
                     <description>PC14 value</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PC14MODE</name>
                     <description>PC14 mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PC15VALUE</name>
                     <description>PC15 value</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PC15MODE</name>
                     <description>PC15 mode</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALRMASSR</name>
               <description>alarm A sub second register</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>SS</name>
                     <description>Sub seconds value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>MASKSS</name>
                     <description>Mask the most-significant bits starting
              at this bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKP0R</name>
               <description>backup register</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>BKP</name>
                     <description>BKP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="BKP0R"> <name>BKP1R</name> <addressOffset>0x54</addressOffset> </register>
            <register derivedFrom="BKP0R"> <name>BKP2R</name> <addressOffset>0x58</addressOffset> </register>
            <register derivedFrom="BKP0R"> <name>BKP3R</name> <addressOffset>0x5C</addressOffset> </register>
            <register derivedFrom="BKP0R"> <name>BKP4R</name> <addressOffset>0x60</addressOffset> </register>
         </registers>
      </peripheral>
